Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ལ་ཐོགས་པ་མེད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ཉམས་པ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Incorruptible perfection of insight is insight that is unimpeded with respect to both mundane and supramundane phenomena.

source: དེ་དག་ནི་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six incorruptible perfections.

source: དེ་ལ་བཅོས་མ་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six uncontrived perfections?

source: ཡོངས་སུ་བརྟས་པའི་ངོ་བོས་ཆོས་ཀྱི་སྦྱིན་པ་དང་། ཟང་ཟིང་གི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་བཅོས་མ་མ་ཡིན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Uncontrived perfection of generosity is giving the Dharma and material things on a grand scale.

source: ལེ་ལོ་མེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་བཅོས་མ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Uncontrived perfection of discipline is discipline free from laziness.

source: བསམ་པ་ཡང་དག་པར་འཕགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བཅོས་མ་མ་ཡིན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Uncontrived perfection of patience is the perfection of patience with a truly noble intent.

source: ཡོ་བྱད་ཟང་ཟིང་གི་ཆེད་མ་ཡིན་པར་ཐམས་ཅད་དུ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བཅོས་མ་མ་ཡིན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Uncontrived perfection of diligence is the perfection of diligence that does not strive for the sake of material things.

source: མངོན་པར་ཞེན་པ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བཅོས་མ་མ་ཡིན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Uncontrived perfection of concentration is the perfection of concentration free from clinging.

source: རྗེས་སུ་བསྲུང་བ་མེད་པར་གཞན་ལ་ཕན་འདོགས་པར་འགྱུར་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བཅོས་མ་མ་ཡིན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Uncontrived perfection of insight is the perfection of insight that benefits others without having anything to safeguard.

source: འདི་དག་ནི་བཅོས་མ་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six uncontrived perfections.

source: དེ་ལ་དབུལ་པོ་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for freedom from poverty?

source: དབུལ་པོས་གཞན་ལ་ཕན་པའི་ཕྱིར་ཡོངས་སུ་བསྔོས་ལ་བདག་ཉིད་རྣམ་པར་སྨིན་པ་བདེ་བའི་ཕྱིར་ཞུགས་པ་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་དབུལ་པོ་མ་ཡིན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity for freedom from poverty is generosity that is dedicated to helping others who are poor and does not harbor any personal expectation of a gratifying ripening.

source: བདེ་འགྲོར་ཡོངས་སུ་བསྔོ་བ་དང་བྲལ་བའི་སྡོམ་པ་གང་ཡིན་པ་དེ་ནི་དབུལ་པོ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline for freedom from poverty is an observance of vows that is not dedicated only to higher realms.

source: ཟང་ཟིང་གི་ཕྱིར་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་དབུལ་པོ་མ་ཡིན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience for freedom from poverty is patience for the sake of material things.

source: ཟང་ཟིང་དང་འབྲེལ་པའི་ལུས་དང་སེམས་ཀྱི་རྩོལ་བ་གང་ཡིན་པ་དེ་ནི་དབུལ་པོ་མ་ཡིན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence for freedom from poverty is physical and mental effort linked to material things.

source: ཚངས་པར་སྐྱེ་བར་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་བསྐྱེད་པ་གང་ཡིན་པ་དེ་ནི་དབུལ་པོ་མ་ཡིན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration for freedom from poverty is to arouse a concentration that is dedicated to birth as Brahmā.

source: ཉོན་མོངས་པ་དང་ཉེ་བར་སྤྱོད་པ་འདྲེས་པ་མང་པོ་ཐོབ་ནས་གནས་ཏེ་སྐྱོན་རྟོགས་ཀྱང་མི་སྤོང་ཞིང་སྨོད་པར་མི་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་དབུལ་པོ་མ་ཡིན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight for freedom from poverty is ample involvement in defilements without giving them up or criticizing them although one understands their flawed nature.

source: འདི་དག་ནི་དབུལ་པོ་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for freedom from poverty.

source: དེ་ལ་ཕྱིར་མི་ལྡོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six irreversible perfections?

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ལ་མི་གནས་པའི་སྦྱིན་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་གང་ཡིན་པ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Irreversible perfection of generosity is giving that is not based on hearers and solitary buddhas but is irreversible with respect to awakening.

source: བྱང་ཆུབ་ཇི་སྲིད་པའི་བར་དུ་ཚུལ་ཁྲིམས་རྒྱུན་ཆད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Irreversible perfection of discipline is discipline that remains uninterrupted right up to awakening.

source: འཇིག་རྟེན་ལས་འདས་པ་ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པ་གང་ཡིན་པ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Irreversible perfection of patience is patience beyond the mundane levels and the levels of hearers and solitary buddhas.

source: ནམ་ཐམས་ཅད་མཁྱེན་པ་ཐོབ་ཀྱི་བར་དུ་ཐབས་མཁས་པས་ཡོངས་སུ་ཟིན་པའི་བརྩོན་འགྲུས་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Irreversible perfection of diligence is diligence embraced by skillful means that remains unimpeded right up to the attainment of omniscience.

source: བྱང་ཆུབ་སེམས་དཔའ་འདོད་པའི་ཡོན་ཏན་ལ་ལོངས་སྤྱོད་ཅིང་དུས་ཐམས་ཅད་དུ་ཐབས་མཁས་པའི་ཤེས་རབ་ཀྱིས་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Irreversible perfection of concentration is the activity of the bodhisattvas as they enjoy sense pleasures while constantly practicing skillful insight.

source: ཐ་ན་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་མི་འཕྲོགས་ཤིང་འཇིག་རྟེན་ལས་འདས་པའི་ཡང་དག་པའི་ལྟ་བ་ལས་བྱུང་བ་སྙིང་རྗེ་ཆེན་པོས་ཉེ་བར་བརྟན་པའི་ཤེས་རབ་རྒྱ་ཆེན་པོ་གང་ཡིན་པ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Irreversible perfection of insight is vast insight supported by great compassion that cannot be swayed by monks, brahmins, hearers, or solitary buddhas and has arisen from the genuine view beyond the world.

source: འདི་དག་ནི་ཕྱིར་མི་ལྡོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six irreversible perfections.

source: དེ་ལ་རྣམ་པར་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of accomplishment?

source: སྐྱོ་བ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བསྒྲུབ་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on accomplishment is the perfection of generosity free from weariness.

source: ཐོས་པ་ཉུང་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བསྒྲུབ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on accomplishment is the perfection of discipline based on minimal study.

source: ཞེ་སྡང་དང་ཞེ་སྡང་མ་ཡིན་པ་ལ་མི་བལྟ་བར་གནས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བསྒྲུབ་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on accomplishment is the perfection of patience that prevails regardless of whether there is anger.

source: རོ་མྱང་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བསྒྲུབ་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on accomplishment is the perfection of diligence applied for the sake of relishing experiences.

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བདག་མེད་པ་ལས་ཕྱི་རོལ་དུ་གྱུར་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བསྒྲུབ་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on accomplishment is the transcendent acceptance deriving from selflessness that pertains to the perfection of concentration.

source: འཇིག་རྟེན་གྱི་བྱ་བ་ལ་གཞོལ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བསྒྲུབ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on accomplishment is the perfection of insight that pursues mundane activities.

source: འདི་དག་ནི་རྣམ་པར་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of accomplishment.

source: དེ་ལ་དག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of purity?

source: རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་དག་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on purity is the perfection of generosity without any expectation of ripening.

source: ལེ་ལོ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་དག་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on purity is the perfection of discipline free from laziness.

source: དམིགས་པ་མེད་པའི་ཆོས་དང་ལྡན་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་དག་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on purity is patience endowed with the qualities of nonapprehension.

source: བདག་དང་གཞན་ལ་གནོད་པ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་དག་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on purity is the perfection of diligence that harms neither oneself nor others.

source: དངོས་པོ་མེད་པ་དང་དམིགས་པ་མེད་པའི་སྟོབས་བསྐྱེད་པ་ཐོབ་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་དག་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on purity is the perfection of concentration consisting in attainment that generates the power of the absence of entities and the absence of apprehensions.

source: སྒྲིབ་པ་ཐམས་ཅད་བསལ་ཅིང་ཕྱིན་ཅི་ལོག་མེད་པ་རྣམ་པར་བསྒོམས་པ་གང་ཡིན་པ་དེ་ནི་དག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on purity is meditation that dispels all obscurations and is free from error.

source: འདི་དག་ནི་དག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of purity.

source: དེ་ལ་བརྟན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of stability?

source: བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་ན་བདུད་ཀྱིས་སྤྲུལ་ནས་དབྱེ་བར་མི་ནུས་ཤིང་གདུང་བ་མེད་པར་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་བརྟན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on stability occurs when bodhisattvas practice generosity such that they cannot be disturbed by the emanations of the māras and become able to relinquish all possessions without any anxiety.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དགེ་མཚན་དང་བཀྲ་ཤིས་ལ་མི་གནས་ཤིང་། བྱང་ཆུབ་ཏུ་ངེས་པར་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་བརྟན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on stability is the perfection of discipline that is not based on rites and rituals but dedicated wholly to awakening.

source: རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་མེད་ཅིང་ཐུན་མོང་མ་ཡིན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བརྟན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on stability is the extraordinary perfection of patience that is free of attachment and anger.

source: མཁས་པས་བསྙེམས་པ་མེད་ཅིང་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྒྱུར་བྱེད་ནས་མི་སྐྱོ་བ་གང་ཡིན་པ་དེ་ནི་བརྟན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on stability is the absence of weariness that is free of conceit based on learning and causes the perfection of diligence.

source: ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོས་པ་དང་། དབང་བ་དང་། སྙོམས་པར་འཇུག་པ་དག་བརྟན་པར་བྱ་བའི་ཕྱིར་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བརྟན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on stability is the perfection of concentration that is dedicated to the processes of ripening and practiced for the sake of stabilizing masteries and meditative attainments.

source: ཆོས་ལ་ངེས་པར་རྟོགས་པའི་བཟོད་པས་ངེས་པར་བྱུང་ཞིང་ཐམས་ཅད་དུ་རྨོངས་པ་མེད་པར་གནས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བརྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on stability is insight that gains emancipation and remains in all regards free of confusion through acceptance that clearly comprehends the Dharma.

source: འདི་དག་ནི་བརྟན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of stability.

source: དེ་ལ་བརྟུན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of exertion?

source: དམིགས་པ་མེད་པར་གནས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བརྟུན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on exertion is the perfection of generosity that abides by nonapprehension.

source: བསྙེམས་པ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བརྟུན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on exertion is the perfection of discipline free of conceit.

source: རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་སྤོང་བ་ལ་དམིགས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བརྟུན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on exertion is patience that focuses on the abandonment of attachment and anger.

source: ངར་འཛིན་པ་དང་། སྡུག་བསྔལ་སྣ་ཚོགས་སྤང་བ་དང་། སྨད་པའི་ཕྱིར་བདག་གི་ངལ་བ་སྤངས་ནས་སྟོང་པ་ཉིད་ཀྱི་རྗེས་སུ་འཐུན་པ་གང་ཡིན་པ་དེ་ནི་བརྟུན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on exertion is the harmonizing with emptiness that occurs when one has abandoned one’s own discomfort in order to relinquish and denounce ego-clinging and the various forms of suffering.

source: གང་མི་རྟག་པས་ཡིད་བྱུང་སྟེ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་སྟོབས་རྙེད་ཅིང་ཡོངས་སུ་གཏུགས་པ་མེད་པས་ཕྱེ་བ་གང་ཡིན་པ་དེ་ནི་བརྟུན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on exertion is an uninterrupted understanding caused by sadness due to impermanence and mastery of dependent origination.

source: འདོད་ཆགས་དང་བྲལ་བར་ཞུགས་པ་གཉིས་སུ་མེད་པས་རབ་ཏུ་ཕྱེ་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བརྟུན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on exertion is insight distinguished by nondual immersion in freedom from desire.

source: འདི་དག་ནི་བརྟུན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of exertion.

source: དེ་ལ་ངོམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of satisfaction?

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐར་པར་ཡོངས་སུ་སྔོ་ཞིང་འཁོར་བར་ཡོངས་སུ་མི་སྔོ་བ་གང་ཡིན་པ་དེ་ནི་ངོམས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on satisfaction is the perfection of generosity that is dedicated to liberation and not to saṃsāra.

source: ནག་ནོག་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ངོམས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on satisfaction is the perfection of discipline that is uncontaminated.

source: བྱང་ཆུབ་སེམས་དཔའི་ངོམས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནག་ནོག་ཅན་གང་ཡིན་པ་ཡོད་དེ། ཚུལ་ཁྲིམས་དེས་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་སྨོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནག་ནོག་ཅན་ནོ། །
en: There is also such a thing as a bodhisattva’s perfection of discipline based on satisfaction that is contaminated, namely the discipline that aspires to the levels of hearers or solitary buddhas.

source: སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་བཀོད་པ་དཔག་ཏུ་མེད་པ་དག་འགྲུབ་པར་བྱེད་ཅིང་བླ་ན་མེད་པའི་སྨོན་ལམ་འདོད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ངོམས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on satisfaction is the perfection of patience that accomplishes the immeasurable array of buddha qualities and aims for unsurpassable prayers.

source: འདུས་བྱས་རྣམས་ལ་ལྷག་པར་ཆགས་པ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ངོམས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on satisfaction is the perfection of diligence free from attachment to conditioned phenomena.

source: འཐུན་པ་དང་མི་འཐུན་པས་རབ་ཏུ་ཕྱེ་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ངོམས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on satisfaction is the perfection of concentration that distinguishes what is conducive from what is not conducive.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཡོངས་སུ་བཟུང་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ངོམས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on satisfaction is the perfection of insight focused on the three gateways to liberation.

source: འདི་དག་ནི་ངོམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of satisfaction.

source: དེ་ལ་འཇིག་རྟེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six mundane perfections?

source: སྦྱིན་པ་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་མི་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Mundane perfection of generosity is generosity that is not dedicated to awakening.

source: ཚུལ་ཁྲིམས་རྣམ་པ་བདུན་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Mundane perfection of discipline consists of the seven types of discipline.

source: སོ་སོར་བརྟགས་པའི་སྟོབས་ཀྱིས་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Mundane perfection of patience is fueled by analysis.

source: འཇིག་རྟེན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདུ་འཛི་ཅན་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Mundane perfection of diligence is socializing related to the mundane perfection of diligence.

source: སྐྱེ་བར་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Mundane perfection of concentration is concentration dedicated to birth.

source: འཇིག་རྟེན་གྱི་ཆོས་རྣམས་འདྲིས་པར་གནས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Mundane perfection of insight is the perfection of insight that is accustomed to the phenomena of the world.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་འཇིག་རྟེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the bodhisattvas’ six mundane perfections.

source: དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six supramundane perfections?

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་ཆོས་ཀྱི་སྦྱིན་པ་དང་། ཟང་ཟིང་གི་སྦྱིན་པ་མངོན་པར་བསྒྲུབས་པའི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པའི་བསམ་པ་འགྲུབ་ལ། མྱུར་དུ་མྱ་ངན་ལས་འདས་པ་ཞི་བ་མཆོག་ཐོབ་པར་འགྱུར་རོ་ཞེས། བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་གསུངས་པ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Supramundane perfection of generosity is what the Blessed One has explained as follows: ‘The ripening of the merit that is achieved through giving the Dharma and material things for the sake of awakening fulfills one’s wishes and soon brings the supreme peace of nirvāṇa.’

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྡོམ་པ་ཤིན་ཏུ་བསལ་ཞིང་གང་ན་བག་ཆགས་ཀྱི་ཉིང་མཚམས་སྦྱོར་བ་འགག་པ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Supramundane perfection of discipline is the dispelling of the vows of hearers and solitary buddhas and the cessation of the linkages of karmic imprints.

source: ཟག་པ་མེད་པའི་ཆོས་རྣམས་ཀྱིས་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Supramundane perfection of patience is acceptance in terms of unadulterated phenomena.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པས་ནམ་བྱང་ཆུབ་ཀྱི་བར་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རྩོལ་བ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Supramundane perfection of diligence consists in efforts for the sake of ripening sentient beings—efforts that continue through to spiritual awakening and are based on having attained acceptance that phenomena are nonarising.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ལ་དབང་པོ་དང་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་དུ་གནས་པ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Supramundane perfection of concentration is to remain in absorption for the sake of perfecting the faculties and wisdom that are based on bodhisattva qualities.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་དང་ཐུན་མོང་མ་ཡིན་པ་བྱང་ཆུབ་ཕྱོགས་གཅིག་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མཐར་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Supramundane perfection of insight is the perfection of the wisdom of omniscience, the single factor of awakening that is not shared with hearers and solitary buddhas.

source: འདི་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ།། །།
en: Such are the six supramundane perfections.

source: དེ་ལ་བླ་ན་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six unsurpassable perfections?

source: སངས་རྒྱས་ཀྱི་ཞིང་དུ་བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བའི་བཀོད་པ་ཚད་མེད་པ་དང་། ང་རྒྱལ་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱི་མོས་པའི་རྣམ་པར་སྨིན་པ་བསྐལ་པ་གྲངས་མེད་པར་རྒྱུན་མི་འཆད་པ་གང་ཡིན་པ་དེ་ནི་བླ་ན་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The unsurpassable perfection of generosity consists of infinite displays that empower bodhisattvas within buddha realms as well as the continuous process of ripening proud sentient beings throughout incalculable eons.

source: ཆོས་ཀྱི་འདུ་ཤེས་ལ་གནས་ནས་ངན་སོང་གསུམ་ཡོངས་སུ་སྤངས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བླ་ན་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Unsurpassable perfection of discipline is to maintain the perception of the Dharma such that the three lower realms are relinquished, and the buddha realms are occupied.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གསེར་གྱི་མདོག་ལྟ་བུར་འགྱུར་བ། གནོད་སེམས་ཐམས་ཅད་ཆུང་བ་གང་ཡིན་པ་དེ་ནི་བླ་ན་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Unsurpassable perfection of patience is the universal decrease of animosity that gives the circle of bodhisattvas their golden hue.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་མི་འཁྲུགས་པའི་ཡི་དམ་མ་བཏང་བ་གང་ཡིན་པ་དེ་ནི་བླ་ན་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Unsurpassable perfection of diligence is not letting go of the bodhisattva’s unshakable commitment.

source: ཁྱིམ་པར་གྱུར་པ་བཙུན་མོའི་འཁོར་ན་གནས་ཀྱང་བསམ་གཏན་བཞི་ཆུད་མི་ཟ་ལ་འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འཁོར་ཉོན་མོངས་པ་ཆུང་བའི་རྣམ་པར་སྨིན་པ་གང་ཡིན་པ་དེ་ནི་བླ་ན་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Unsurpassable perfection of concentration is ensuring that the four concentrations are not wasted even if one is to dwell as a householder within a harem, and this ripens as a retinue with few defilements within a buddha realm.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཅིང་ཚེ་དཔག་ཏུ་མེད་པ་དང་། བཀོད་པ་དཔག་ཏུ་མེད་པ་དང་། འཁོར་དཔག་ཏུ་མེད་པའི་ནང་དུ་སྤོབས་པ་གང་ཡིན་པ་དེ་ནི་བླ་ན་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Unsurpassable perfection of insight is to maintain buddha realms with limitless life, limitless arrays, and eloquence amidst a limitless audience.

source: འདི་དག་ནི་བླ་ན་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six unsurpassable perfections.

source: དེ་ལ་གཡེང་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections free from distraction?

source: བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བསྔོ་བའི་རྣམ་པར་སྨིན་པས་མངོན་པར་ཤེས་པ་མྱུར་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་གཡེང་བ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity free from distraction is the bodhisattva’s perfection of generosity that swiftly gains superknowledge through the ripening by way of dedication.

source: ས་གང་ན་གང་གི་འཕགས་པའི་ཆོས་རྣམས་རྒྱུན་མི་འཆད་པར་གནས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་གཡེང་བ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline free from distraction is the perfection of discipline that continuously adheres to noble qualities pertaining to the various spiritual levels.

source: དགེ་བའི་ཆོས་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་གཡེང་བ་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience free from distraction is the accomplishment of virtuous qualities.

source: ཡིད་བྱུང་བས་རབ་ཏུ་བསྐྱེད་པ་དང་། མྱ་ངན་ལས་འདས་པས་རབ་ཏུ་བསྐྱེད་པ་དང་། འདོད་ཆགས་དང་བྲལ་བས་རབ་ཏུ་བསྐྱེད་པ་དང་། མ་དད་པ་རྣམས་ཀྱི་དྲན་པ་དང་། སངས་རྒྱས་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ལས་བརྩམས་པ་གང་ཡིན་པ་དེ་ནི་གཡེང་བ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence free from distraction is produced through disillusionment, nirvāṇa, and freedom from desire. It is undertaken due to recollection of those who lack faith and the buddhas’ roots of virtue.
